Tekla.Structures.DirectManipulation.Adapter.TsMessenger
The Tekla.Structures.DirectManipulation.Adapter.TsMessenger class provides a set of helper methods for communicating with contextual toolbar.

Tekla.Structures.DirectManipulation.Adapter.TsMessenger.InterruptActiveCommand
Interrupts the active command.

Tekla.Structures.DirectManipulation.Adapter.TsMessenger.GetContextualToolsMessage(System.Windows.FrameworkElement,System.Guid,Tekla.BIM.DirectManipulation.Services.Controls.ControlsGroupType,System.String)
Gets the message to be sent to contextual toolbar.
element: The element.
identifier: The identifier of the controls group.
type: The type.
toolbarUiName: Toolbar UI name.
Returns: The message.

Tekla.Structures.DirectManipulation.Adapter.TsMessenger.GetContextualToolsConfigurationMessage(System.Boolean)
Gets the visibility update message to be sent to contextual toolbar.
isVisible: The new visibility.
Returns: The message.

Tekla.Structures.DirectManipulation.Adapter.TsMessenger.GetContextualToolbarMessage(System.Collections.Generic.IEnumerable{System.Type},System.Guid)
Gets the supported object types register message to be sent to contextual toolbar.
supportedTypes: The supported object types.
identifier: The identifier of the controls group.
Returns: The message.

Tekla.Structures.DirectManipulation.Adapter.TsMessenger.GetCommandToolbarMessage(System.Windows.FrameworkElement,System.Guid)
Gets the message to be sent to command toolbar.
element: The element.
identifier: The identifier of the controls group.
Returns: The message.

Tekla.Structures.DirectManipulation.Adapter.TsMessenger.SendAsBatch(System.Collections.Generic.IEnumerable{Tekla.BIM.Common.Contracts.DataMessage})
Sends the messages in a batch.
messages: The messages.

Tekla.Structures.DirectManipulation.Adapter.TsMessenger.EnableCommands(System.String[])
Enables the TS commands.
commandNames: The command names.

Tekla.Structures.DirectManipulation.Adapter.TsMessenger.DisableCommands(System.String[])
Disables the TS commands.
commandNames: The command names.